export const REGEX = {
  PHONE: /^(?:\+84|84|0)(3[2-9]|5(6|8|9)|7(0|6|7|8|9)|8[1-9]|9[0-9])\d{7}$/,
  NUMBER: /^[0-9]+$/,
  SKU: /^[^\s]*$/,
  CODE: /^[a-zA-Z0-9#_/\\|.-]{0,100}$/,
  USERNAME: /^(\d|\w)+$/,
  EMAIL: /^[a-zA-Z0-9](\.?[a-zA-Z0-9_%+-])*@[a-zA-Z0-9-]+(\.[a-zA-Z]{2,})+$/,
  VIETNAMESE_AND_NUMBER:
    /^[0-9a-zA-ZàáảãạăằắẳẵặâầấẩẫậđèéẻẽẹêềếểễệìíỉĩịòóỏõọôồốổỗộơờớởỡợùúủũụưừứửữựỳýỷỹỵÀÁẢÃẠĂẰẮẲẴẶÂẦẤẨẪẬĐÈÉẺẼẸÊỀẾỂỄỆÌÍỈĨỊÒÓỎÕỌÔỒỐỔỖỘƠỜỚỞỠỢÙÚỦŨỤƯỪỨỬỮỰỲÝỶỸỴ[\]{}\\|\s]+$/,
  LATITUDE: /^-?(90(\.0+)?|[1-8]?\d(\.\d+)?)$/,
  LONGITUDE: /^-?(180(\.0+)?|(1[0-7]\d|\d{1,2})(\.\d+)?)$/,
}
